In [2]:
import numpy as np
import pandas as pd

In [15]:
df = pd.read_csv('titanic.csv', index_col=['PassengerId'])

In [28]:
df.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#output the colums of df

In [ ]:
# how many missing values are there in the age column

In [ ]:
# replace the missing values in the age column with the average age of the non-missing values

In [ ]:
# find the unique values of Pclass

In [ ]:
# sort the data by the Name

In [ ]:
# sort the data by name and sex

In [ ]:
# find the mean, standard deviation and minimum and maximum values of Age

In [27]:
#calculate the total number of Titanic passengers in each class

In [ ]:
#calculate the proportion of Titanic passengers in each class who survived

In [ ]:
#calculate the average age in each class

In [ ]:
#calculate the average ticket fare in each class

In [ ]:
#calculate the proportion of each gender who survived in each class

In [ ]:
#create a column that has the first letter of the Name field for each row

In [ ]:
#for each letter above, calculate the proportion of titanic passengers who survived

In [ ]:
# use pd.cut (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.qcut.html)
# to create a new variable that bins age into groups of 5 years